#+TITLE: Notes on the design of the CoLiS language
#+OPTIONS: ^:nil
** Stdin/stdout
- stdin and stdout are string lists to simplify the specification of ~echo~ and ~read~
- stdout has invariant ~stdout <> []~
- empty stdout is singleton list
- stdout: print by expanding the first line, newline conses an empty string
- ~echo -n~ adds to last element, echo adds to last element, and appends ""
#+begin_src ocaml
  let echo (n: bool) (line: string) (stdout: string list) : string list =
      match stdout with
      | [] -> assert false
      | h :: t ->
          let stdout = (h ^ line) :: t in
          if n then stdout else "" :: stdout
#+end_src
- the last line is lost when piping:
#+begin_src sh
(echo A; echo -n B) | while read x; do echo $x; done
#+end_src

#+RESULTS:
: A
- NO! This is due to ~read~, the last line is kept by indirection and embedded
#+begin_src sh
  (echo A; echo -n B)|cat
#+end_src

#+RESULTS:
| A |
| B |

#+begin_src sh
  x=$(echo A; echo -n B)
  echo $x
#+end_src

#+RESULTS:
: A B

** Strict
- single flag indicating evaluation under condition for now
- ~set -e/+e~ requires second flag
#+begin_src sh
dash -ec 'if set +e; then echo X; fi; false; echo A/$?'; echo --$?~
#+end_src

#+RESULTS:
| X    |
| A/1  |
| --0~ |

- To implement ~set -e/+e~, a second field indicating the global strict mode
  (~strict_mode~) has to be added in the state and added in this test as ~ctx.strict_mode
  && negb ctx.under_condition~ to account for the following example:
